app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    render :json => Feed.all

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render :json => Feed.find(params[:id]), include: :latest_entries

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://lorem-rss.herokuapp.com/feed?unit=second&interval=20' LIMIT 1
---
  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 2]]
---
  def destroy
    @feed = Feed.find(params[:id])

    if @feed.destroy